tap "buildpacks/tap"
# tap "cycloud-io/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "ktr0731/evans"
tap "teamookla/speedtest"
brew "abseil"
brew "argo"
brew "m4"
brew "autoconf"
brew "snappy"
brew "xz"
brew "ca-certificates"
brew "mpdecimal"
brew "openssl@1.1"
brew "openssl@3"
brew "python@3.11"
brew "docutils"
brew "six"
brew "awscli"
brew "bat"
brew "bat-extras"
brew "bdw-gc"
brew "brotli"
brew "c-ares"
brew "libnghttp2"
brew "libuv"
brew "node"
brew "bitwarden-cli"
brew "black"
brew "lz4"
brew "zstd"
brew "boost"
brew "caddy"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "lzo"
brew "pixman"
brew "catimg"
brew "clang-format"
brew "cmatrix"
brew "colordiff"
brew "gmp"
brew "coreutils"
brew "cowsay"
brew "direnv"
brew "eslint"
brew "libgit2"
brew "exa"
brew "fd"
brew "flake8"
brew "fonttools"
brew "libtool"
brew "freetds"
brew "fzf"
brew "giflib"
brew "harfbuzz"
brew "libtiff"
brew "little-cms2"
brew "openjdk"
brew "gcviewer"
brew "gdbm"
brew "gh"
brew "openjpeg"
brew "ghostscript"
brew "ghq"
brew "git-delta"
brew "glow"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "protobuf"
brew "re2"
brew "grpc"
brew "grpcurl"
brew "pkg-config"
brew "guile"
brew "hadolint"
brew "helm"
brew "hey"
brew "ncurses"
brew "htop"
brew "httpie"
brew "hyperkit"
brew "imath"
brew "ipython"
brew "oniguruma"
brew "jq"
brew "jsonschema"
brew "libyaml"
brew "jupyterlab"
brew "kcat"
brew "kind"
brew "krew"
brew "lazydocker"
brew "lazygit"
brew "libdvdcss"
brew "libffi"
brew "libiconv"
brew "libpq"
brew "libssh"
brew "unibilium"
brew "libtermkey"
brew "libxml2"
brew "libxmlsec1"
brew "libzip"
brew "qemu"
brew "lima"
brew "litecli"
brew "lolcat"
brew "luajit"
brew "luv"
brew "mas"
brew "minikube"
brew "mosh"
brew "msgpack"
brew "mycli"
brew "mypy"
brew "tree-sitter"
brew "neovim"
brew "nerdfix"
brew "nkf"
brew "pcre"
brew "nmap"
brew "nyancat"
brew "oath-toolkit"
brew "openexr"
brew "openshift-cli"
brew "openstackclient"
brew "pam-reattach"
brew "pgcli"
brew "virtualenv"
brew "poetry"
brew "ponysay"
brew "prettier"
brew "pwgen"
brew "ripgrep"
brew "rustup-init"
brew "sl"
brew "socat"
brew "socket_vmnet"
brew "source-highlight"
brew "stern"
brew "tcl-tk"
brew "telnet"
brew "terraform-ls"
brew "terraform@0.12"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tmux-xpanes"
brew "tmuxp"
brew "tree"
brew "viddy"
brew "watch"
brew "webp"
brew "wget"
brew "yapf"
brew "yarn"
brew "yq"
brew "z"
brew "buildpacks/tap/pack"
# brew "cycloud-io/tap/cycloud-cli"
brew "ktr0731/evans/evans"
brew "teamookla/speedtest/speedtest"
cask "authy"
cask "aws-vpn-client"
cask "bloomrpc"
cask "docker"
cask "fig"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "forticlient-vpn"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "handbrake"
cask "intellij-idea"
cask "kindle"
cask "kitty"
cask "licecap"
cask "postman"
cask "slack"
cask "tableau"
cask "tradingview"
cask "visual-studio-code"
cask "webex"
cask "zoom"
# mas "1Blocker", id: 1365531024
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
vscode "ahmadawais.shades-of-purple"
vscode "amandeepmittal.pug"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "dbaeumer.vscode-eslint"
vscode "dorzey.vscode-sqlfluff"
vscode "EditorConfig.EditorConfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "Evidence.sqltools-bigquery-driver"
vscode "exiasr.hadolint"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ilkka.google-java-format"
vscode "kjhx.vscode-lifeline"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "naumovs.color-highlight"
vscode "pnp.polacode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "RobbOwen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "shengchen.vscode-checkstyle"
vscode "sysoev.language-stylus"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "xaver.clang-format"
vscode "zxh404.vscode-proto3"
