tap "cycloud-io/tap", "git@github.com:cycloud-io/homebrew-tap.git"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sdkman/tap"
tap "teamookla/speedtest"
brew "abseil"
brew "ca-certificates"
brew "certifi"
brew "pycparser"
brew "openssl@3"
brew "libyaml"
brew "mpdecimal"
brew "xz"
brew "ansible"
brew "ansible-lint"
brew "brotli"
brew "giflib"
brew "imath"
brew "libpng"
brew "lz4"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "argo"
brew "argocd"
brew "atuin"
brew "m4"
brew "autoconf"
brew "snappy"
brew "avro-c"
brew "python@3.11"
brew "awscli"
brew "libgit2"
brew "oniguruma"
brew "bat"
brew "bat-extras"
brew "bdw-gc"
brew "c-ares"
brew "libnghttp2"
brew "libuv"
brew "node"
brew "bitwarden-cli"
brew "black"
brew "boost"
brew "buf"
brew "caddy"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "lzo"
brew "pixman"
brew "catimg"
brew "clang-format"
brew "cmatrix"
brew "gmp"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "ncurses"
brew "qemu"
brew "lima"
brew "colima"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "devcontainer"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docutils"
brew "eslint"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "openjpeg"
brew "ffmpeg"
brew "flake8"
brew "fonttools"
brew "libtool"
brew "freetds"
brew "fzf"
brew "openjdk"
brew "gcviewer"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "gping"
brew "protobuf"
brew "re2"
brew "grpc"
brew "grpcurl"
brew "pkg-config"
brew "guile"
brew "hadolint"
brew "helm"
brew "helm-ls"
brew "hey"
brew "htop"
brew "httpie"
brew "ipython"
brew "isort"
brew "jq"
brew "jsonschema"
brew "jupyterlab"
brew "librdkafka"
brew "kcat"
brew "kind"
brew "krb5"
brew "kubernetes-cli"
brew "krew"
brew "lazydocker"
brew "lazygit"
brew "libdvdcss"
brew "libffi"
brew "libfido2"
brew "libiconv"
brew "libpq"
brew "unibilium"
brew "libtermkey"
brew "libxml2"
brew "libxmlsec1"
brew "libzip"
brew "pygments"
brew "six"
brew "litecli"
brew "lolcat"
brew "luajit"
brew "luv"
brew "mas"
brew "minikube"
brew "mono"
brew "mosh"
brew "msgpack"
brew "mycli"
brew "mypy"
brew "mysql-client"
brew "tree-sitter"
brew "neovim"
brew "nerdfix"
brew "nkf"
brew "pcre"
brew "nmap"
brew "nyancat"
brew "oath-toolkit"
brew "openshift-cli"
brew "openssl@1.1"
brew "openstackclient"
brew "pack"
brew "pam-reattach"
brew "pgcli"
brew "pipx"
brew "poetry"
brew "ponysay"
brew "prettier"
brew "prettierd"
brew "pwgen"
brew "python-lsp-server"
brew "ripgrep"
brew "rustup-init"
brew "s3cmd"
brew "sl"
brew "socat"
brew "socket_vmnet"
brew "sops"
brew "source-highlight"
brew "sqlfluff"
brew "stern"
brew "stylua"
brew "tcl-tk"
brew "telnet"
brew "terraform-ls"
brew "tfenv"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tmux-xpanes"
brew "tmuxp"
brew "tree"
brew "viddy"
brew "virtualenv", link: false
brew "watch"
brew "wget"
brew "yamlfmt"
brew "yapf"
brew "yarn"
brew "yq"
brew "z"
brew "cycloud-io/tap/cycloud-cli"
brew "sdkman/tap/sdkman-cli"
brew "teamookla/speedtest/speedtest"
cask "arc"
cask "codewhisperer"
cask "dotnet-sdk"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "handbrake"
cask "intellij-idea"
cask "kindle"
cask "kitty"
cask "licecap"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "slack"
cask "tradingview"
cask "unity-hub"
cask "visual-studio-code"
cask "warp"
cask "webex"
cask "zoom"
mas "1Blocker", id: 1365531024
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PreviewYaml", id: 1564574724
mas "Tailscale", id: 1475387142
mas "Vimari", id: 1480933944
mas "Web Translator", id: 6443492610
mas "Xcode", id: 497799835
vscode "ahmadawais.shades-of-purple"
vscode "amandeepmittal.pug"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bufbuild.vscode-buf"
vscode "dbaeumer.vscode-eslint"
vscode "dorzey.vscode-sqlfluff"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "evidence.sqltools-bigquery-driver"
vscode "exiasr.hadolint"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.heygithub"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "helm-ls.helm-ls"
vscode "ilkka.google-java-format"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "kjhx.vscode-lifeline"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "naumovs.color-highlight"
vscode "pnp.polacode"
vscode "postman.postman-for-vscode"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "shengchen.vscode-checkstyle"
vscode "sourcegraph.cody-ai"
vscode "sysoev.language-stylus"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "wayou.vscode-todo-highlight"
vscode "xaver.clang-format"
vscode "zxh404.vscode-proto3"
